
## Plan Result (stg)




<pre><code>Plan: 6 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sftp_user_password[&#34;inbound&#34;]
  * azurerm_key_vault_secret.sftp_user_private_key[&#34;inbound&#34;]
  * azurerm_key_vault_secret.sftp_user_public_key[&#34;inbound&#34;]
  * azurerm_storage_account_local_user.sftp_local_user[&#34;inbound&#34;]
  * tls_private_key.sftp_user_key[&#34;inbound&#34;]
  * module.sftp_storage.azurerm_storage_container.container[&#34;inbound&#34;]
* Update
  * module.opal_key_vault.azurerm_key_vault_access_policy.product_team_access_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.sftp_user_password["inbound"] will be created
  + resource "azurerm_key_vault_secret" "sftp_user_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-stg/providers/Microsoft.KeyVault/vaults/opal-stg"
      + name                    = "inbound-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sftp_user_private_key["inbound"] will be created
  + resource "azurerm_key_vault_secret" "sftp_user_private_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-stg/providers/Microsoft.KeyVault/vaults/opal-stg"
      + name                    = "inbound-private-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sftp_user_public_key["inbound"] will be created
  + resource "azurerm_key_vault_secret" "sftp_user_public_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-stg/providers/Microsoft.KeyVault/vaults/opal-stg"
      + name                    = "inbound-public-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_storage_account_local_user.sftp_local_user["inbound"] will be created
  + resource "azurerm_storage_account_local_user" "sftp_local_user" {
      + home_directory       = "inbound"
      + id                   = (known after apply)
      + name                 = "inbound"
      + password             = (sensitive value)
      + sid                  = (sensitive value)
      + ssh_key_enabled      = true
      + ssh_password_enabled = true
      + storage_account_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-stg/providers/Microsoft.Storage/storageAccounts/opalsftpstg"

      + permission_scope {
          + resource_name = "inbound"
          + service       = "blob"

          + permissions {
              + create = true
              + delete = true
              + list   = true
              + read   = true
              + write  = true
            }
        }

      + ssh_authorized_key {
          + description = "SFTP User Public Key"
          + key         = (known after apply)
        }
    }

  # tls_private_key.sftp_user_key["inbound"] will be created
  + resource "tls_private_key" "sftp_user_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.opal_key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-stg/providers/Microsoft.KeyVault/vaults/opal-stg/objectId/e6e67c03-3a16-4881-a8c6-290ba01a9a99"
      ~ secret_permissions      = [
            # (3 unchanged elements hidden)
            "Recover",
          - "Get",
        ]
        # (7 unchanged attributes hidden)
    }

  # module.sftp_storage.azurerm_storage_container.container["inbound"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "inbound"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "opalsftpstg"
    }

Plan: 6 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->